 # 2. Напишите програм2му, которая на вход принимает 5 чисел и находит максимальное из них.
# num_max = 0
# for i in range(5): # range - это итерации сбора
#     num = int(input())
#     if num_max < num:
#         num_max = num
# print(f'Max number is: {num_max}')
