# 3. Напишите программу, которая будет на вход принимать
                        # число N и выводить числа от -N до N


# def range_numbers_n():
#     n = int(input('Enter your number: '))
#     print(*range(-n, n+1))            # * перед range - это оператор РАСПАКОВКИ ДИАПАЗОНА

# range_numbers_n()
