   # 4. Напишите программу, которая будет принимать на вход дробь
                            # и показывать первую цифру дробной части числа.

# def number_check():
#     n = float(input('Enter your number: '))
#     new_num = int(n * 10 % 10) 
#     print(new_num)            # * перед range - это оператор РАСПАКОВКИ ДИАПАЗОНА

# number_check()