# Напишите программу, которая принимает на 
# вход число N и выдаёт последовательность из N членов.

# ААААА что за задчка!!!..????


def n_func():
    for n in range(int(input('Enter your number: '))):
        print((-3) ** n, end = ' ')
n_func()
